Revit 2027 API
BuiltInFailures.DocumentFailures.CannotLoadLink Property
 Can't load Linked File [Name] due to errors. Open it separately to investigate the problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotLoadLink { get; }
Public Shared ReadOnly Property CannotLoadLink As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotLoadLink {
	FailureDefinitionId^ get ();
}
static member CannotLoadLink : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DocumentFailures Class
Autodesk.Revit.DB Namespace